app/Controllers/Admin.php

SELECT `users`.`id` as `userid`, `username`, `email`, `user_image`, `deleted_at`, `name`
FROM `users`
JOIN `auth_groups_users` ON `auth_groups_users`.`user_id` = `users`.`id`
JOIN `auth_groups` ON `auth_groups`.`id` = `auth_groups_users`.`group_id`
---
    public function getData()
    {
        $data['title'] = 'User List';
        if ($this->request->isAJAX()) {
            // $data = [
            //     'list' => $this->ModelUser->find()
            // ];
            $this->builder->select('users.id as userid, username, email, user_image, deleted_at, name');
            $this->builder->join('auth_groups_users', 'auth_groups_users.user_id = users.id');
            $this->builder->join('auth_groups', 'auth_groups.id = auth_groups_users.group_id');

SELECT `users`.`id` as `userid`, `username`, `email`, `user_image`, `fullname`, `alamat`, `jenis_kelamin`, `deleted_at`, `tanggal_lahir`, `tempat_lahir`, `telepon`, `created_at`, `name`
FROM `users`
JOIN `auth_groups_users` ON `auth_groups_users`.`user_id` = `users`.`id`
JOIN `auth_groups` ON `auth_groups`.`id` = `auth_groups_users`.`group_id`
WHERE `users`.`id` = '56'
---
    public function detail($id = 0)
    {
        $data['title'] = 'User Detail';
        $this->builder->select('users.id as userid, username, email, user_image, fullname, alamat, jenis_kelamin, deleted_at, tanggal_lahir, tempat_lahir, telepon, created_at, name');
        $this->builder->join('auth_groups_users', 'auth_groups_users.user_id = users.id');
        $this->builder->join('auth_groups', 'auth_groups.id = auth_groups_users.group_id');
        $this->builder->where('users.id', $id);

SELECT *
FROM `labs`
---
    public function labs()
    {
        $data['title'] = 'Lab List';
        $query = $this->labsBuilder->get();

SELECT *
FROM `labs`
WHERE `lab_id` = '1'
---
    public function labDetail($id = 0)
    {
        $data['title'] = 'Lab Detail';
        $query = $this->labsBuilder->getWhere(['lab_id' => $id]);

SELECT *
FROM `reservasi`
---
    public function acc()
    {
        $data['title'] = 'Reserver List';
        $query = $this->reservasi->get();

SELECT *
FROM `reservasi`
SELECT *
FROM `labs`
SELECT `id`
FROM `users`
WHERE `deleted_at` IS NOT NULL
---
    public function getDashboardData()
    {
        $now = date("Y-m-d");
        $year = date("Y");
        $month = date("m");
        // $oneMonthBefore = strtotime('-1 month', $now);
        // $oneMonthAfter = strtotime('+1 month', $now);
        // $oneYearBefore = strtotime('-1 year', $now);
        // $oneYearAfter = strtotime('+1 year', $now);

        $this->builder->select('id');
        $this->builder->where('deleted_at IS NOT NULL');
        $deletedUserQuery = $this->builder->get();
        $rsvpQuery = $this->reservasi->get();
        $roleQuery = $this->roleBuilder->get();
        $labQuery = $this->labsBuilder->get();
        $data['deletedUsers'] = $deletedUserQuery->getResult();

SELECT COUNT(*) AS `numrows`
FROM `reservasi`
WHERE `tanggal` = '2022-06-28'
AND `status` = 'verif'
---
        //Daily reservation
        $this->reservasi->where('tanggal', $now);
        $this->reservasi->where('status', "verif");
        $data['dailyRsvp'] = $this->reservasi->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `reservasi`
WHERE YEAR(tanggal) = '2022'
AND MONTH(tanggal) = '06'
AND `status` = 'verif'
---
        $this->reservasi->where("YEAR(tanggal)", $year);
        $this->reservasi->where("MONTH(tanggal)", $month);
        $this->reservasi->where('status', "verif");
        $data['monthlyRsvp'] = $this->reservasi->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `reservasi`
WHERE YEAR(tanggal) = '2022'
AND `status` = 'verif'
---
        //Yearly reservation
        $this->reservasi->where("YEAR(tanggal)", $year);
        $this->reservasi->where('status', "verif");
        $data['yearlyRsvp'] = $this->reservasi->countAllResults();