app/Controllers/Guest.php

SELECT *
FROM `labs`
---
    public function labs()
    {
        $data['title'] = 'Lab List';
        $query = $this->labsBuilder->get();