app/Controllers/User.php

    public function edit($id)
    {
        $data['title'] = 'User Detail';
        $this->builder->select('users.id as userid, username, email, user_image, fullname, alamat, jenis_kelamin, deleted_at, tanggal_lahir, tempat_lahir, telepon, created_at, name, password_hash');
        $this->builder->join('auth_groups_users', 'auth_groups_users.user_id = users.id');
        $this->builder->join('auth_groups', 'auth_groups.id = auth_groups_users.group_id');
        $this->builder->where('users.id', $id);
        $query = $this->builder->get();
---
SELECT `users`.`id` as `userid`, `username`, `email`, `user_image`, `fullname`, `alamat`, `jenis_kelamin`, `deleted_at`, `tanggal_lahir`, `tempat_lahir`, `telepon`, `created_at`, `name`, `password_hash`
FROM `users`
JOIN `auth_groups_users` ON `auth_groups_users`.`user_id` = `users`.`id`
JOIN `auth_groups` ON `auth_groups`.`id` = `auth_groups_users`.`group_id`
WHERE `users`.`id` = '56'

    public function update($id)
    {
        if ($this->request->getFile('user_image')->getName() != '') {
            $avatar = $this->request->getFile('user_image');
            $namaavatar = $avatar->getRandomName();
            $avatar->move(ROOTPATH . 'public/img/', $namaavatar);
        } else {
            $namaavatar = $this->request->getVar('avalama');
        }
        $passbaru = $this->request->getVar('password');
        $passlama = $this->request->getVar('passlama');
        if ($passbaru != $passlama) {
            $pass = Password::hash($passbaru, PASSWORD_DEFAULT);
        } else {
            $pass = $this->request->getVar('passlama');
        }
        $this->ModelUser->save([
            'id' => $id,
            'fullname' => $this->request->getVar('fullname'),
            'alamat' => $this->request->getVar('alamat'),
            'tempat_lahir' => $this->request->getVar('tempat_lahir'),
            'tanggal_lahir' => $this->request->getVar('tanggal_lahir'),
            'jenis_kelamin' => $this->request->getVar('jenis_kelamin'),
            'telepon' => $this->request->getVar('telepon'),
            'email' => $this->request->getVar('email'),
            'password_hash' => $pass,
            'user_image' => $namaavatar
        ]);
---
UPDATE `users` SET `fullname` = 'Juniar Aldi Nugroho', `alamat` = '', `tempat_lahir` = 'Wonogiri', `tanggal_lahir` = '2000-06-09', `jenis_kelamin` = 'Laki-Laki', `telepon` = '0812738127', `email` = 'juniar@student.uns.ac.id', `password_hash` = '$2y$10$DcGdw8TQleyKh712jG9EWuy.H0TrdNR.PNYrxrTOUK6Mg2901hvkq', `user_image` = 'default.jpg', `updated_at` = '2022-06-16 10:32:10'
WHERE `users`.`id` IN ('43')

    public function reservation()
    {
        $data['title'] = 'Jam Reservasi';
        $query = $this->waktuBuilder->get();
        $this->labsBuilder->select('lab_id');
        $this->labsBuilder->where('status', 'closed');
        $labsQuery = $this->labsBuilder->get();
        $data['waktu'] = $query->getResult();
---
SELECT *
FROM `waktu`

    public function getDatas()
    {
        $data['title'] = 'User List';
        if ($this->request->isAJAX()) {
            // $data = [
            //     'list' => $this->ModelUser->find()
            // ];
            $this->reservasi->select('*');
            $query = $this->reservasi->get();
---
SELECT *
FROM `reservasi`